{"id": "1", "title": "Y Combinator-backed Motion raises fresh $38M to build the Microsoft Office of AI agents", "url": "https://techcrunch.com/2025/09/08/y-combinator-backed-motion-raises-fresh-38m-to-build-the-microsoft-office-of-ai-agents/", "source": "techcrunch.com", "date": "2025-09-08T00:00:00Z", "full_text": "By the time Harry Qi was 23 years old, he had achieved the kind of financial success that most people will never attain: making about $1 million a year. He was working as “a quant” in his first job out of college. That’s hedge-fund speak for a stock-trading analyst at a statistical-model driven “quant” fund. But, like many people who spend their energies pursuing ever more money, he felt empty. “At some point you just want to make a much bigger impact on this world,” Qi, now 29, tells TechCrunch. So in 2019, he and his high school buddy, Omid Rooholfada, along with Ethan Yu (Qi’s friend from college — also working at a hedge fund) built an AI calendaring and task management app and applied to Y Combinator. They were accepted into the Winter 2020 batch and promptly quit their jobs to go be founders. Motion has since added a fourth co-founder, early employee Chander Ramesh. Over the next six years, they steadily grew Motion’s mostly professional consumer customer base until, in May, they launched an integrated AI agent bundle for small and mid-sized businesses. They saw usage of their agent bundle explode. In four months, that segment of their business alone grew to over 10,000 B2B customers, and $10 million in ARR, Qi tells TechCrunch. Their growth led to a five-times oversubscribed $38 million Series C round, led by Stacey Bishop at Scale Venture Partners, and a fast preemptive C2 round at a $550 million post-money valuation. Techcrunch event Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech. Grab your ticket before Sept 26 to save up to $668. Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech. Grab your ticket before Sept 26 to save up to $668. San Francisco | REGISTER NOW The startup has raised $75 million to date from investors like HOF Capital, 468 Capital, and SignalFire with participation from Valor Equity Partners, Fellows Fund, Leonis Capital, and some other big names, like the Altman brothers’ fund Apollo Projects. Y Combinator has invested in every round as well, Qi says. The company is doing so well that Ashutosh Desai, Qi’s executive coach from his YC days, and a YC advisor, joined as a full-timer as well. Motion is specifically geared toward small-mid-sized businesses that don’t have bazillion-dollar budgets to custom write and train their own agents. Its appeal is that all agentic functions (each with a different human name) are integrated with the others. So far the suite includes an “executive assistant” for automating scheduling, note taking, email replies; a sales rep; customer support rep; and a blog- and social-media-post writing marketing assistant. The agents also integrate with hundreds of other typical SMB tools like Slack, Google Apps, Teams, Salesforce, etc. Motion charges via usage: a base set of credits, plus additional credits as needed, depending on the number of agents uses. Prices range from $29 per month for 1 seat, 1,000 credits and limited agent functions, to $600 for 25 seats and all agents, 250,000 credits. Then custom pricing from there. Qi views Motion like building the agentic equivalent of Microsoft Office. “There’s an opportunity here to build the next Microsoft,” he said. “You basically have to build all the applications.” This is in contrast to buying point AI products — a sales rep, a customer service bot, a blog-writing one — that don’t work together. Despite the admitted “stress” he endures as a founder building in AI’s fast-changing field, he says he wouldn’t go back to his old life. He’s on a texting-friends basis with many of his customers and every day one of them tells him how Motion makes their lives easier, increases their productivity or revenue. “If I’m answering very honestly, financially speaking, it was still a bad decision. I’d probably be making somewhere between three and ten million a year right now,” he jokes, while also noting that his now middle-class, early-stage founder income is still comfortable. But he also dreams of building an enduring company, like a Microsoft. “Was this the right path?” he nods, thinking of his customers. “What gets you out of bed is just knowing you actually built something useful.”", "model_input": "By the time Harry Qi was 23 years old, he had achieved the kind of financial success that most people will never attain: making about $1 million a year. He was working as “a quant” in his first job out of college. That’s hedge-fund speak for a stock-trading analyst at a statistical-model driven “quant” fund. But, like many people who spend their energies pursuing ever more money, he felt empty. “At some point you just want to make a much bigger impact on this world,” Qi, now 29, tells TechCrunch. So in 2019, he and his high school buddy, Omid Rooholfada, along with Ethan Yu (Qi’s friend from college — also working at a hedge fund) built an AI calendaring and task management app and applied to Y Combinator. They were accepted into the Winter 2020 batch and promptly quit their jobs to go be founders. Motion has since added a fourth co-founder, early employee Chander Ramesh. Over the next six years, they steadily grew Motion’s mostly professional consumer customer base until, in May, they launched an integrated AI agent bundle for small and mid-sized businesses. They saw usage of their agent bundle explode. In four months, that segment of their business alone grew to over 10,000 B2B customers, and $10 million in ARR, Qi tells TechCrunch. Their growth led to a five-times oversubscribed $38 million Series C round, led by Stacey Bishop at Scale Venture Partners, and a fast preemptive C2 round at a $550 million post-money valuation. Techcrunch event Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech. Grab your ticket before Sept 26 to save up to $668. Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech. Grab your ticket before Sept 26 to save up to $668. San Francisco | REGISTER NOW The startup has raised $75 million to date from investors like HOF Capital, 468 Capital, and SignalFire with participation from Valor Equity Partners, Fellows Fund, Leonis Capital, and some other big names, like the Altman brothers’ fund Apollo Projects. Y Combinator has invested in every round as well, Qi says. The company is doing so well that Ashutosh Desai, Qi’s executive coach from his YC days, and a YC advisor, joined as a full-timer as well. Motion is specifically geared toward small-mid-sized businesses that don’t have bazillion-dollar budgets to custom write and train their own agents. Its appeal is that all agentic functions (each with a different human name) are integrated with the others. So far the suite includes an “executive assistant” for automating scheduling, note taking, email replies; a sales rep; customer support rep; and a blog- and social-media-post writing marketing assistant. The agents also integrate with hundreds of other typical SMB tools like Slack, Google Apps, Teams, Salesforce, etc. Motion charges via usage: a base set of credits, plus additional credits as needed, depending on the number of agents uses. Prices range from $29 per month for 1 seat, 1,000 credits and limited agent functions, to $600 for 25 seats and all agents, 250,000 credits. Then custom pricing from there. Qi views Motion like building the agentic equivalent of Microsoft Office. “There’s an opportunity here to build the next Microsoft,” he said. “You basically have to build all the applications.” This is in contrast to buying point AI products — a sales rep, a customer service bot, a blog-writing one — that don’t work together. Despite the admitted “stress” he endures as a founder building in AI’s fast-changing field, he says he wouldn’t go back to his old life. He’s on a texting-friends basis with many", "tokens_full": 1138, "tokens_input": 1000, "sentences": ["By the time Harry Qi was 23 years old, he had achieved the kind of financial success that most people will never attain: making about $1 million a year", "He was working as “a quant” in his first job out of college", "That’s hedge-fund speak for a stock-trading analyst at a statistical-model driven “quant” fund", "But, like many people who spend their energies pursuing ever more money, he felt empty", "“At some point you just want to make a much bigger impact on this world,” Qi, now 29, tells TechCrunch", "So in 2019, he and his high school buddy, Omid Rooholfada, along with Ethan Yu (Qi’s friend from college — also working at a hedge fund) built an AI calendaring and task management app and applied to Y Combinator", "They were accepted into the Winter 2020 batch and promptly quit their jobs to go be founders", "Motion has since added a fourth co-founder, early employee Chander Ramesh", "Over the next six years, they steadily grew Motion’s mostly professional consumer customer base until, in May, they launched an integrated AI agent bundle for small and mid-sized businesses", "They saw usage of their agent bundle explode", "In four months, that segment of their business alone grew to over 10,000 B2B customers, and $10 million in ARR, Qi tells TechCrunch", "Their growth led to a five-times oversubscribed $38 million Series C round, led by Stacey Bishop at Scale Venture Partners, and a fast preemptive C2 round at a $550 million post-money valuation", "Techcrunch event Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge", "Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech", "Grab your ticket before Sept 26 to save up to $668", "Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge", "Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech", "Grab your ticket before Sept 26 to save up to $668", "San Francisco | REGISTER NOW The startup has raised $75 million to date from investors like HOF Capital, 468 Capital, and SignalFire with participation from Valor Equity Partners, Fellows Fund, Leonis Capital, and some other big names, like the Altman brothers’ fund Apollo Projects", "Y Combinator has invested in every round as well, Qi says", "The company is doing so well that Ashutosh Desai, Qi’s executive coach from his YC days, and a YC advisor, joined as a full-timer as well", "Motion is specifically geared toward small-mid-sized businesses that don’t have bazillion-dollar budgets to custom write and train their own agents", "Its appeal is that all agentic functions (each with a different human name) are integrated with the others", "So far the suite includes an “executive assistant” for automating scheduling, note taking, email replies; a sales rep; customer support rep; and a blog- and social-media-post writing marketing assistant", "The agents also integrate with hundreds of other typical SMB tools like Slack, Google Apps, Teams, Salesforce, etc", "Motion charges via usage: a base set of credits, plus additional credits as needed, depending on the number of agents uses", "Prices range from $29 per month for 1 seat, 1,000 credits and limited agent functions, to $600 for 25 seats and all agents, 250,000 credits", "Then custom pricing from there", "Qi views Motion like building the agentic equivalent of Microsoft Office", "“There’s an opportunity here to build the next Microsoft,” he said", "“You basically have to build all the applications", "” This is in contrast to buying point AI products — a sales rep, a customer service bot, a blog-writing one — that don’t work together", "Despite the admitted “stress” he endures as a founder building in AI’s fast-changing field, he says he wouldn’t go back to his old life", "He’s on a texting-friends basis with many of his customers and every day one of them tells him how Motion makes their lives easier, increases their productivity or revenue", "“If I’m answering very honestly, financially speaking, it was still a bad decision", "I’d probably be making somewhere between three and ten million a year right now,” he jokes, while also noting that his now middle-class, early-stage founder income is still comfortable", "But he also dreams of building an enduring company, like a Microsoft", "“Was this the right path", "” he nods, thinking of his customers", "“What gets you out of bed is just knowing you actually built something useful", "”"], "summary": "", "authors": "Julie Bort, Venture Editor, Sean O'Kane, Maxwell Zeff, Aisha Malik, Connie Loizos, Jagmeet Singh, --C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var, Media, Min-Width", "keywords": "agents, dont, microsoft, fresh, y, ai, tech, tells, million, capital, combinatorbacked, fund, qi, office, build, raises, motion, credits, growth", "content_hash": "5154c436b59ac160e0241c2ab3856b83d9ee14e1810b1feca70afbb3ab80c6d7", "fetched_at": "2025-09-08T16:39:42.523777+00:00"}
